benchmark/io/results/ADATA_SP900_256G-LVM-i3-2120T.out
seq-write: (g=0): rw=write, bs=4M-4M/4M-4M/4M-4M, ioengine=libaio, iodepth=128
seq-read: (g=1): rw=read, bs=4M-4M/4M-4M/4M-4M, ioengine=libaio, iodepth=128
seq-rw: (g=2): rw=rw, bs=4M-4M/4M-4M/4M-4M, ioengine=libaio, iodepth=128
rand-write: (g=3): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
rand-read: (g=4): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
rand-rw: (g=5): rw=randrw, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
threaded-write: (g=6): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
threaded-read: (g=7): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
threaded-rw: (g=8): rw=randrw, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
threaded-80-20: (g=9): rw=randrw, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
streaming-write: (g=10): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
streaming-read: (g=11): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
streaming-rw: (g=12): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
fio-2.1.11
Starting 118 processes

seq-write: (groupid=0, jobs=1): err= 0: pid=15056: Tue Nov  4 01:42:06 2014
  write: io=95628MB, bw=326234KB/s, iops=79, runt=300162msec
    slat (usec): min=236, max=232807, avg=12616.56, stdev=23012.49
    clat (msec): min=134, max=3379, avg=1566.60, stdev=489.58
     lat (msec): min=155, max=3380, avg=1579.13, stdev=492.48
    clat percentiles (msec):
     |  1.00th=[  445],  5.00th=[ 1106], 10.00th=[ 1156], 20.00th=[ 1221],
     | 30.00th=[ 1270], 40.00th=[ 1352], 50.00th=[ 1418], 60.00th=[ 1549],
     | 70.00th=[ 1713], 80.00th=[ 1909], 90.00th=[ 2147], 95.00th=[ 2737],
     | 99.00th=[ 2999], 99.50th=[ 3130], 99.90th=[ 3294], 99.95th=[ 3326],
     | 99.99th=[ 3392]
    bw (KB  /s): min=  409, max=490538, per=97.55%, avg=318256.34, stdev=97131.71
    lat (msec) : 250=0.20%, 500=1.03%, 750=1.08%, 1000=1.07%, 2000=81.37%
    lat (msec) : >=2000=15.79%
  cpu          : usr=2.69%, sys=1.87%, ctx=6973, majf=0, minf=8
  IO depths    : 1=0.1%, 2=0.1%, 4=0.2%, 8=0.4%, 16=0.8%, 32=1.6%, >=64=99.1%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=23780/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
seq-read: (groupid=1, jobs=1): err= 0: pid=15844: Tue Nov  4 01:42:06 2014
  read : io=150392MB, bw=513099KB/s, iops=124, runt=300140msec
    slat (usec): min=178, max=53319, avg=7927.90, stdev=13314.40
    clat (msec): min=129, max=1151, avg=992.55, stdev=118.49
     lat (msec): min=144, max=1170, avg=1000.48, stdev=117.86
    clat percentiles (msec):
     |  1.00th=[  289],  5.00th=[  898], 10.00th=[  988], 20.00th=[  996],
     | 30.00th=[ 1012], 40.00th=[ 1020], 50.00th=[ 1020], 60.00th=[ 1020],
     | 70.00th=[ 1029], 80.00th=[ 1029], 90.00th=[ 1029], 95.00th=[ 1029],
     | 99.00th=[ 1057], 99.50th=[ 1090], 99.90th=[ 1139], 99.95th=[ 1139],
     | 99.99th=[ 1156]
    bw (KB  /s): min=  408, max=518071, per=96.33%, avg=494266.57, stdev=91371.74
    lat (msec) : 250=0.67%, 500=1.57%, 750=1.61%, 1000=24.09%, 2000=72.39%
  cpu          : usr=0.08%, sys=3.96%, ctx=10499, majf=0, minf=131081
  IO depths    : 1=0.1%, 2=0.1%, 4=0.2%, 8=0.4%, 16=0.8%, 32=1.6%, >=64=100.2%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=37471/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
seq-rw: (groupid=2, jobs=1): err= 0: pid=16396: Tue Nov  4 01:42:06 2014
  read : io=68076MB, bw=232255KB/s, iops=56, runt=300144msec
    slat (usec): min=183, max=67725, avg=9145.17, stdev=15327.19
    clat (msec): min=141, max=1367, avg=1138.12, stdev=149.92
     lat (msec): min=175, max=1367, avg=1147.24, stdev=150.09
    clat percentiles (msec):
     |  1.00th=[  318],  5.00th=[  938], 10.00th=[ 1106], 20.00th=[ 1139],
     | 30.00th=[ 1139], 40.00th=[ 1156], 50.00th=[ 1172], 60.00th=[ 1172],
     | 70.00th=[ 1188], 80.00th=[ 1205], 90.00th=[ 1221], 95.00th=[ 1237],
     | 99.00th=[ 1254], 99.50th=[ 1270], 99.90th=[ 1287], 99.95th=[ 1303],
     | 99.99th=[ 1336]
    bw (KB  /s): min= 3996, max=315076, per=96.60%, avg=224363.34, stdev=43948.65
  write: io=63616MB, bw=217038KB/s, iops=52, runt=300144msec
    slat (usec): min=231, max=67766, avg=9006.88, stdev=15042.05
    clat (msec): min=140, max=1334, avg=1128.00, stdev=129.23
     lat (msec): min=158, max=1334, avg=1137.01, stdev=128.90
    clat percentiles (msec):
     |  1.00th=[  379],  5.00th=[ 1074], 10.00th=[ 1106], 20.00th=[ 1123],
     | 30.00th=[ 1139], 40.00th=[ 1139], 50.00th=[ 1156], 60.00th=[ 1156],
     | 70.00th=[ 1172], 80.00th=[ 1172], 90.00th=[ 1188], 95.00th=[ 1205],
     | 99.00th=[ 1237], 99.50th=[ 1254], 99.90th=[ 1319], 99.95th=[ 1336],
     | 99.99th=[ 1336]
    bw (KB  /s): min=  408, max=289774, per=99.14%, avg=215170.39, stdev=37239.45
    lat (msec) : 250=0.58%, 500=1.36%, 750=1.44%, 1000=1.46%, 2000=95.55%
  cpu          : usr=1.88%, sys=3.23%, ctx=9518, majf=0, minf=8
  IO depths    : 1=0.1%, 2=0.1%, 4=0.2%, 8=0.4%, 16=0.8%, 32=1.7%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=16945/w=15851/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
rand-write: (groupid=3, jobs=1): err= 0: pid=17204: Tue Nov  4 01:42:06 2014
  write: io=41832MB, bw=142783KB/s, iops=35695, runt=300005msec
    slat (usec): min=2, max=13337, avg= 7.36, stdev=15.30
    clat (usec): min=43, max=60805, avg=3576.83, stdev=2475.55
     lat (usec): min=49, max=60811, avg=3584.52, stdev=2476.03
    clat percentiles (usec):
     |  1.00th=[  498],  5.00th=[  780], 10.00th=[ 1112], 20.00th=[ 1560],
     | 30.00th=[ 2008], 40.00th=[ 2448], 50.00th=[ 2928], 60.00th=[ 3600],
     | 70.00th=[ 4640], 80.00th=[ 5664], 90.00th=[ 6816], 95.00th=[ 7520],
     | 99.00th=[ 9792], 99.50th=[11328], 99.90th=[22656], 99.95th=[30336],
     | 99.99th=[47360]
    bw (KB  /s): min=    0, max=273056, per=99.86%, avg=142582.59, stdev=46259.47
    lat (usec) : 50=0.01%, 100=0.01%, 250=0.19%, 500=0.82%, 750=3.50%
    lat (usec) : 1000=3.73%
    lat (msec) : 2=21.52%, 4=34.32%, 10=35.00%, 20=0.77%, 50=0.14%
    lat (msec) : 100=0.01%
  cpu          : usr=9.60%, sys=34.83%, ctx=2150902, majf=0, minf=6
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=106.2%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=10708772/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
rand-read: (groupid=4, jobs=1): err= 0: pid=17931: Tue Nov  4 01:42:06 2014
  write: io=42090MB, bw=143664KB/s, iops=35915, runt=300006msec
    slat (usec): min=2, max=17472, avg= 7.14, stdev=19.16
    clat (usec): min=29, max=65846, avg=3555.18, stdev=2583.40
     lat (usec): min=56, max=65851, avg=3562.54, stdev=2583.90
    clat percentiles (usec):
     |  1.00th=[  410],  5.00th=[  716], 10.00th=[ 1012], 20.00th=[ 1496],
     | 30.00th=[ 1944], 40.00th=[ 2384], 50.00th=[ 2864], 60.00th=[ 3472],
     | 70.00th=[ 4512], 80.00th=[ 5664], 90.00th=[ 6880], 95.00th=[ 7776],
     | 99.00th=[10304], 99.50th=[11968], 99.90th=[23168], 99.95th=[33536],
     | 99.99th=[48384]
    bw (KB  /s): min=    0, max=273056, per=99.75%, avg=143311.69, stdev=49833.97
    lat (usec) : 50=0.01%, 100=0.01%, 250=0.35%, 500=1.28%, 750=3.92%
    lat (usec) : 1000=4.12%
    lat (msec) : 2=21.48%, 4=34.10%, 10=33.54%, 20=1.05%, 50=0.14%
    lat (msec) : 100=0.01%
  cpu          : usr=9.71%, sys=34.55%, ctx=2148609, majf=0, minf=7
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=103.1%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=10774898/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
rand-rw: (groupid=5, jobs=1): err= 0: pid=18562: Tue Nov  4 01:42:06 2014
  read : io=11485MB, bw=39201KB/s, iops=9800, runt=300008msec
    slat (usec): min=2, max=20364, avg= 6.79, stdev=19.62
    clat (usec): min=113, max=74126, avg=6699.57, stdev=4699.62
     lat (usec): min=117, max=74133, avg=6706.54, stdev=4699.69
    clat percentiles (usec):
     |  1.00th=[  516],  5.00th=[  980], 10.00th=[ 1512], 20.00th=[ 2544],
     | 30.00th=[ 3536], 40.00th=[ 4640], 50.00th=[ 5856], 60.00th=[ 7136],
     | 70.00th=[ 8512], 80.00th=[10304], 90.00th=[12992], 95.00th=[15040],
     | 99.00th=[20864], 99.50th=[24704], 99.90th=[31616], 99.95th=[36096],
     | 99.99th=[49920]
    bw (KB  /s): min=19184, max=105920, per=100.00%, avg=39208.62, stdev=9873.61
  write: io=11484MB, bw=39198KB/s, iops=9799, runt=300008msec
    slat (usec): min=2, max=13989, avg= 7.76, stdev=15.61
    clat (usec): min=18, max=72731, avg=6343.58, stdev=4718.65
     lat (usec): min=46, max=72737, avg=6351.59, stdev=4718.73
    clat percentiles (usec):
     |  1.00th=[  274],  5.00th=[  628], 10.00th=[ 1096], 20.00th=[ 2096],
     | 30.00th=[ 3088], 40.00th=[ 4256], 50.00th=[ 5536], 60.00th=[ 6816],
     | 70.00th=[ 8256], 80.00th=[10048], 90.00th=[12736], 95.00th=[14784],
     | 99.00th=[20352], 99.50th=[23936], 99.90th=[30848], 99.95th=[35584],
     | 99.99th=[49408]
    bw (KB  /s): min=    0, max=106230, per=99.86%, avg=39142.22, stdev=10008.74
    lat (usec) : 20=0.01%, 50=0.01%, 100=0.01%, 250=0.36%, 500=1.83%
    lat (usec) : 750=2.39%, 1000=2.55%
    lat (msec) : 2=9.81%, 4=19.10%, 10=42.94%, 20=19.88%, 50=1.12%
    lat (msec) : 100=0.01%
  cpu          : usr=6.32%, sys=19.73%, ctx=1609555, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=102.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=2940125/w=2939890/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
threaded-write: (groupid=6, jobs=16): err= 0: pid=18953: Tue Nov  4 01:42:06 2014
  write: io=54110MB, bw=184669KB/s, iops=46160, runt=300041msec
    slat (usec): min=2, max=157251, avg=352.15, stdev=2052.11
    clat (usec): min=73, max=499992, avg=44028.01, stdev=25992.72
     lat (usec): min=86, max=541592, avg=44373.09, stdev=26212.99
    clat percentiles (msec):
     |  1.00th=[   16],  5.00th=[   21], 10.00th=[   23], 20.00th=[   27],
     | 30.00th=[   30], 40.00th=[   33], 50.00th=[   36], 60.00th=[   40],
     | 70.00th=[   47], 80.00th=[   60], 90.00th=[   78], 95.00th=[   94],
     | 99.00th=[  137], 99.50th=[  161], 99.90th=[  235], 99.95th=[  273],
     | 99.99th=[  355]
    bw (KB  /s): min=    0, max=21079, per=6.26%, avg=11552.91, stdev=4162.97
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.14%, 20=4.60%, 50=68.62%
    lat (msec) : 100=22.87%, 250=3.69%, 500=0.08%
  cpu          : usr=0.47%, sys=1.57%, ctx=712839, majf=0, minf=133
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=101.1%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=13850065/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
threaded-read: (groupid=7, jobs=16): err= 0: pid=19389: Tue Nov  4 01:42:06 2014
  write: io=39128MB, bw=133550KB/s, iops=33380, runt=300014msec
    slat (usec): min=2, max=99655, avg=481.26, stdev=2499.76
    clat (usec): min=112, max=359622, avg=60873.45, stdev=26321.65
     lat (usec): min=120, max=359626, avg=61350.87, stdev=26558.49
    clat percentiles (msec):
     |  1.00th=[   19],  5.00th=[   24], 10.00th=[   29], 20.00th=[   36],
     | 30.00th=[   44], 40.00th=[   53], 50.00th=[   60], 60.00th=[   67],
     | 70.00th=[   74], 80.00th=[   83], 90.00th=[   95], 95.00th=[  108],
     | 99.00th=[  135], 99.50th=[  147], 99.90th=[  178], 99.95th=[  192],
     | 99.99th=[  223]
    bw (KB  /s): min=    0, max=18039, per=6.25%, avg=8343.12, stdev=2477.95
    lat (usec) : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.02%, 10=0.07%, 20=1.75%, 50=35.27%
    lat (msec) : 100=55.54%, 250=7.36%, 500=0.01%
  cpu          : usr=0.38%, sys=1.22%, ctx=530506, majf=0, minf=131
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=102.4%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=10014702/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
threaded-rw: (groupid=8, jobs=16): err= 0: pid=20065: Tue Nov  4 01:42:06 2014
  read : io=12325MB, bw=42064KB/s, iops=10512, runt=300032msec
    slat (usec): min=2, max=110986, avg=763.73, stdev=4019.70
    clat (usec): min=325, max=493072, avg=98029.56, stdev=37431.50
     lat (usec): min=330, max=512689, avg=98789.86, stdev=37795.99
    clat percentiles (msec):
     |  1.00th=[   43],  5.00th=[   55], 10.00th=[   61], 20.00th=[   70],
     | 30.00th=[   77], 40.00th=[   83], 50.00th=[   90], 60.00th=[   98],
     | 70.00th=[  109], 80.00th=[  122], 90.00th=[  147], 95.00th=[  172],
     | 99.00th=[  225], 99.50th=[  247], 99.90th=[  293], 99.95th=[  314],
     | 99.99th=[  371]
    bw (KB  /s): min=    0, max= 4624, per=6.25%, avg=2630.79, stdev=603.80
  write: io=12308MB, bw=42007KB/s, iops=10498, runt=300032msec
    slat (usec): min=2, max=111644, avg=761.41, stdev=4017.88
    clat (usec): min=45, max=492974, avg=95357.35, stdev=36438.06
     lat (usec): min=90, max=492979, avg=96115.69, stdev=36810.99
    clat percentiles (msec):
     |  1.00th=[   38],  5.00th=[   53], 10.00th=[   59], 20.00th=[   68],
     | 30.00th=[   75], 40.00th=[   81], 50.00th=[   88], 60.00th=[   96],
     | 70.00th=[  106], 80.00th=[  119], 90.00th=[  143], 95.00th=[  167],
     | 99.00th=[  219], 99.50th=[  239], 99.90th=[  285], 99.95th=[  306],
     | 99.99th=[  355]
    bw (KB  /s): min=    0, max= 4507, per=6.25%, avg=2627.22, stdev=602.12
    lat (usec) : 50=0.01%, 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
    lat (usec) : 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.02%, 10=0.02%, 20=0.15%, 50=2.96%
    lat (msec) : 100=60.23%, 250=36.25%, 500=0.39%
  cpu          : usr=0.25%, sys=0.77%, ctx=299655, majf=0, minf=139
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=102.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=3154116/w=3149852/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
threaded-80-20: (groupid=9, jobs=16): err= 0: pid=20616: Tue Nov  4 01:42:06 2014
  read : io=17097MB, bw=58348KB/s, iops=14581, runt=300048msec
    slat (usec): min=2, max=141219, avg=874.51, stdev=4555.82
    clat (usec): min=287, max=565634, avg=111882.25, stdev=41477.58
     lat (usec): min=305, max=627529, avg=112756.32, stdev=41888.96
    clat percentiles (msec):
     |  1.00th=[   50],  5.00th=[   67], 10.00th=[   73], 20.00th=[   81],
     | 30.00th=[   89], 40.00th=[   96], 50.00th=[  104], 60.00th=[  113],
     | 70.00th=[  123], 80.00th=[  137], 90.00th=[  161], 95.00th=[  188],
     | 99.00th=[  265], 99.50th=[  297], 99.90th=[  375], 99.95th=[  404],
     | 99.99th=[  453]
    bw (KB  /s): min=    0, max= 6117, per=6.25%, avg=3647.63, stdev=740.30
  write: io=4284.4MB, bw=14620KB/s, iops=3653, runt=300048msec
    slat (usec): min=2, max=136171, avg=878.74, stdev=4562.60
    clat (usec): min=118, max=575260, avg=109526.26, stdev=41203.85
     lat (usec): min=123, max=607139, avg=110405.32, stdev=41615.42
    clat percentiles (msec):
     |  1.00th=[   45],  5.00th=[   63], 10.00th=[   71], 20.00th=[   79],
     | 30.00th=[   87], 40.00th=[   94], 50.00th=[  102], 60.00th=[  111],
     | 70.00th=[  121], 80.00th=[  135], 90.00th=[  159], 95.00th=[  186],
     | 99.00th=[  258], 99.50th=[  289], 99.90th=[  367], 99.95th=[  396],
     | 99.99th=[  445]
    bw (KB  /s): min=  198, max= 1545, per=6.26%, avg=915.21, stdev=196.09
    lat (usec) : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.02%, 10=0.01%, 20=0.14%, 50=0.98%
    lat (msec) : 100=45.00%, 250=52.60%, 500=1.28%, 750=0.01%
  cpu          : usr=0.21%, sys=0.66%, ctx=259589, majf=0, minf=138
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=103.3%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=4375152/w=1096303/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
streaming-write: (groupid=10, jobs=16): err= 0: pid=21195: Tue Nov  4 01:42:06 2014
  write: io=85838MB, bw=292982KB/s, iops=73238, runt=300013msec
    slat (usec): min=1, max=21384, avg= 3.01, stdev=12.33
    clat (usec): min=396, max=243248, avg=27960.24, stdev=21722.61
     lat (usec): min=461, max=243251, avg=27963.37, stdev=21722.70
    clat percentiles (msec):
     |  1.00th=[    5],  5.00th=[   11], 10.00th=[   14], 20.00th=[   16],
     | 30.00th=[   17], 40.00th=[   17], 50.00th=[   18], 60.00th=[   20],
     | 70.00th=[   23], 80.00th=[   49], 90.00th=[   64], 95.00th=[   72],
     | 99.00th=[   99], 99.50th=[  112], 99.90th=[  141], 99.95th=[  153],
     | 99.99th=[  196]
    bw (KB  /s): min=    0, max=40636, per=6.31%, avg=18493.76, stdev=10150.93
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.08%, 4=0.38%, 10=3.96%, 20=58.17%, 50=17.86%
    lat (msec) : 100=18.59%, 250=0.94%
  cpu          : usr=0.78%, sys=1.60%, ctx=245838, majf=0, minf=144
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=101.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=21972599/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
streaming-read: (groupid=11, jobs=16): err= 0: pid=21934: Tue Nov  4 01:42:06 2014
  read : io=120151MB, bw=410079KB/s, iops=102513, runt=300027msec
    slat (usec): min=1, max=20361, avg= 2.88, stdev=10.50
    clat (usec): min=386, max=108023, avg=19973.10, stdev=7614.51
     lat (usec): min=389, max=108025, avg=19976.07, stdev=7614.44
    clat percentiles (usec):
     |  1.00th=[ 4960],  5.00th=[ 9792], 10.00th=[12864], 20.00th=[15296],
     | 30.00th=[16064], 40.00th=[16512], 50.00th=[17280], 60.00th=[18304],
     | 70.00th=[22144], 80.00th=[27776], 90.00th=[30592], 95.00th=[33024],
     | 99.00th=[41728], 99.50th=[45824], 99.90th=[56576], 99.95th=[61184],
     | 99.99th=[70144]
    bw (KB  /s): min=    0, max=41916, per=6.26%, avg=25659.56, stdev=7106.12
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.07%, 4=0.45%, 10=5.01%, 20=60.97%, 50=33.22%
    lat (msec) : 100=0.29%, 250=0.01%
  cpu          : usr=0.99%, sys=2.32%, ctx=350105, majf=0, minf=2187
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=103.7%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=30756679/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
streaming-rw: (groupid=12, jobs=16): err= 0: pid=22553: Tue Nov  4 01:42:06 2014
  read : io=64352MB, bw=219583KB/s, iops=54889, runt=300099msec
    slat (usec): min=1, max=109885, avg=78.25, stdev=1414.29
    clat (usec): min=70, max=694702, avg=33458.57, stdev=36610.62
     lat (usec): min=78, max=695743, avg=33536.01, stdev=36632.10
    clat percentiles (usec):
     |  1.00th=[ 1048],  5.00th=[ 2064], 10.00th=[ 3408], 20.00th=[ 8256],
     | 30.00th=[20864], 40.00th=[24192], 50.00th=[26496], 60.00th=[29056],
     | 70.00th=[32128], 80.00th=[40192], 90.00th=[64768], 95.00th=[99840],
     | 99.00th=[193536], 99.50th=[236544], 99.90th=[342016], 99.95th=[419840],
     | 99.99th=[518144]
    bw (KB  /s): min=    0, max=23992, per=6.28%, avg=13796.97, stdev=3292.06
  write: io=7154.2MB, bw=24411KB/s, iops=6102, runt=300099msec
    slat (usec): min=1, max=101053, avg=1079.69, stdev=5234.42
    clat (usec): min=79, max=694695, avg=32862.15, stdev=37277.17
     lat (usec): min=83, max=694699, avg=33942.00, stdev=37509.58
    clat percentiles (usec):
     |  1.00th=[  668],  5.00th=[ 1576], 10.00th=[ 2768], 20.00th=[ 6496],
     | 30.00th=[20096], 40.00th=[23680], 50.00th=[26240], 60.00th=[28544],
     | 70.00th=[31872], 80.00th=[39168], 90.00th=[64768], 95.00th=[100864],
     | 99.00th=[195584], 99.50th=[238592], 99.90th=[346112], 99.95th=[419840],
     | 99.99th=[536576]
    bw (KB  /s): min=    0, max= 2680, per=6.29%, avg=1534.39, stdev=364.61
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.09%, 750=0.33%, 1000=0.60%
    lat (msec) : 2=3.97%, 4=7.08%, 10=9.07%, 20=7.04%, 50=57.05%
    lat (msec) : 100=9.77%, 250=4.60%, 500=0.40%, 750=0.01%
  cpu          : usr=0.53%, sys=1.33%, ctx=522535, majf=0, minf=158
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=102.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=16472360/w=1831229/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=95628MB, aggrb=326234KB/s, minb=326234KB/s, maxb=326234KB/s, mint=300162msec, maxt=300162msec

Run status group 1 (all jobs):
   READ: io=150392MB, aggrb=513098KB/s, minb=513098KB/s, maxb=513098KB/s, mint=300140msec, maxt=300140msec

Run status group 2 (all jobs):
   READ: io=68076MB, aggrb=232254KB/s, minb=232254KB/s, maxb=232254KB/s, mint=300144msec, maxt=300144msec
  WRITE: io=63616MB, aggrb=217038KB/s, minb=217038KB/s, maxb=217038KB/s, mint=300144msec, maxt=300144msec

Run status group 3 (all jobs):
  WRITE: io=41832MB, aggrb=142782KB/s, minb=142782KB/s, maxb=142782KB/s, mint=300005msec, maxt=300005msec

Run status group 4 (all jobs):
  WRITE: io=42090MB, aggrb=143664KB/s, minb=143664KB/s, maxb=143664KB/s, mint=300006msec, maxt=300006msec

Run status group 5 (all jobs):
   READ: io=11485MB, aggrb=39201KB/s, minb=39201KB/s, maxb=39201KB/s, mint=300008msec, maxt=300008msec
  WRITE: io=11484MB, aggrb=39198KB/s, minb=39198KB/s, maxb=39198KB/s, mint=300008msec, maxt=300008msec

Run status group 6 (all jobs):
  WRITE: io=54110MB, aggrb=184669KB/s, minb=184669KB/s, maxb=184669KB/s, mint=300041msec, maxt=300041msec

Run status group 7 (all jobs):
  WRITE: io=39128MB, aggrb=133550KB/s, minb=133550KB/s, maxb=133550KB/s, mint=300014msec, maxt=300014msec

Run status group 8 (all jobs):
   READ: io=12325MB, aggrb=42064KB/s, minb=42064KB/s, maxb=42064KB/s, mint=300032msec, maxt=300032msec
  WRITE: io=12308MB, aggrb=42006KB/s, minb=42006KB/s, maxb=42006KB/s, mint=300032msec, maxt=300032msec

Run status group 9 (all jobs):
   READ: io=17097MB, aggrb=58347KB/s, minb=58347KB/s, maxb=58347KB/s, mint=300048msec, maxt=300048msec
  WRITE: io=4284.4MB, aggrb=14620KB/s, minb=14620KB/s, maxb=14620KB/s, mint=300048msec, maxt=300048msec

Run status group 10 (all jobs):
  WRITE: io=85838MB, aggrb=292982KB/s, minb=292982KB/s, maxb=292982KB/s, mint=300013msec, maxt=300013msec

Run status group 11 (all jobs):
   READ: io=120151MB, aggrb=410079KB/s, minb=410079KB/s, maxb=410079KB/s, mint=300027msec, maxt=300027msec

Run status group 12 (all jobs):
   READ: io=64352MB, aggrb=219583KB/s, minb=219583KB/s, maxb=219583KB/s, mint=300099msec, maxt=300099msec
  WRITE: io=7154.2MB, aggrb=24410KB/s, minb=24410KB/s, maxb=24410KB/s, mint=300099msec, maxt=300099msec

Additional Terse Output:
3;fio-2.1.11;seq-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;97923072;326234;79;300162;236;232807;12616.558387;23012.485255;134190;3379997;1566595.551512;489584.859612;1.000000%=444416;5.000000%=1105920;10.000000%=1155072;20.000000%=1220608;30.000000%=1269760;40.000000%=1351680;50.000000%=1417216;60.000000%=1548288;70.000000%=1712128;80.000000%=1908736;90.000000%=2146304;95.000000%=2736128;99.000000%=2998272;99.500000%=3129344;99.900000%=3293184;99.950000%=3325952;99.990000%=3391488;0%=0;0%=0;0%=0;155437;3380547;1579128.361651;492483.600843;409;490538;97.554620%;318256.338828;97131.705582;2.687891%;1.865665%;6973;0;8;0.1%;0.1%;0.2%;0.4%;0.8%;1.6%;99.1%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.20%;1.03%;1.08%;1.07%;81.37%;15.79%
3;fio-2.1.11;seq-read;1;0;154001408;513098;124;300140;178;53319;7927.904174;13314.400398;129374;1151745;992548.281238;118492.974265;1.000000%=288768;5.000000%=897024;10.000000%=987136;20.000000%=995328;30.000000%=1011712;40.000000%=1019904;50.000000%=1019904;60.000000%=1019904;70.000000%=1028096;80.000000%=1028096;90.000000%=1028096;95.000000%=1028096;99.000000%=1056768;99.500000%=1089536;99.900000%=1138688;99.950000%=1138688;99.990000%=1155072;0%=0;0%=0;0%=0;144799;1170860;1000477.464865;117860.558610;408;518071;96.329857%;494266.568662;91371.743446;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.079963%;3.962164%;10499;0;131081;0.1%;0.1%;0.2%;0.4%;0.8%;1.6%;100.2%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.67%;1.57%;1.61%;24.09%;72.39%;0.00%
3;fio-2.1.11;seq-rw;2;0;69709824;232254;56;300144;183;67725;9145.172039;15327.186136;141948;1367126;1138120.856337;149920.409690;1.000000%=317440;5.000000%=937984;10.000000%=1105920;20.000000%=1138688;30.000000%=1138688;40.000000%=1155072;50.000000%=1171456;60.000000%=1171456;70.000000%=1187840;80.000000%=1204224;90.000000%=1220608;95.000000%=1236992;99.000000%=1253376;99.500000%=1269760;99.900000%=1286144;99.950000%=1302528;99.990000%=1335296;0%=0;0%=0;0%=0;175998;1367409;1147237.464892;150089.783814;3996;315076;96.602573%;224363.338739;43948.649381;65142784;217038;52;300144;231;67766;9006.883643;15042.045360;140341;1334055;1128004.871353;129231.507841;1.000000%=378880;5.000000%=1073152;10.000000%=1105920;20.000000%=1122304;30.000000%=1138688;40.000000%=1138688;50.000000%=1155072;60.000000%=1155072;70.000000%=1171456;80.000000%=1171456;90.000000%=1187840;95.000000%=1204224;99.000000%=1236992;99.500000%=1253376;99.900000%=1318912;99.950000%=1335296;99.990000%=1335296;0%=0;0%=0;0%=0;158241;1334697;1137007.494844;128904.688203;408;289774;99.139503%;215170.394545;37239.445840;1.876439%;3.231793%;9518;0;8;0.1%;0.1%;0.2%;0.4%;0.8%;1.7%;99.9%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.58%;1.36%;1.44%;1.46%;95.55%;0.00%
3;fio-2.1.11;rand-write;3;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;42835596;142782;35695;300005;2;13337;7.360342;15.297660;43;60805;3576.834967;2475.545003;1.000000%=498;5.000000%=780;10.000000%=1112;20.000000%=1560;30.000000%=2008;40.000000%=2448;50.000000%=2928;60.000000%=3600;70.000000%=4640;80.000000%=5664;90.000000%=6816;95.000000%=7520;99.000000%=9792;99.500000%=11328;99.900000%=22656;99.950000%=30336;99.990000%=47360;0%=0;0%=0;0%=0;49;60811;3584.522593;2476.027422;0;273056;99.860339%;142582.588629;46259.467298;9.603872%;34.831536%;2150902;0;6;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;106.2%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.19%;0.82%;3.50%;3.73%;21.52%;34.32%;35.00%;0.77%;0.14%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%
3;fio-2.1.11;rand-read;4;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;43100100;143664;35915;300006;2;17472;7.136236;19.155354;29;65846;3555.179969;2583.396421;1.000000%=410;5.000000%=716;10.000000%=1012;20.000000%=1496;30.000000%=1944;40.000000%=2384;50.000000%=2864;60.000000%=3472;70.000000%=4512;80.000000%=5664;90.000000%=6880;95.000000%=7776;99.000000%=10304;99.500000%=11968;99.900000%=23168;99.950000%=33536;99.990000%=48384;0%=0;0%=0;0%=0;56;65851;3562.542050;2583.901902;0;273056;99.754765%;143311.685619;49833.969066;9.709172%;34.547424%;2148609;0;7;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;103.1%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.35%;1.28%;3.92%;4.12%;21.48%;34.10%;33.54%;1.05%;0.14%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%
3;fio-2.1.11;rand-rw;5;0;11760740;39201;9800;300008;2;20364;6.788214;19.617205;113;74126;6699.569613;4699.623231;1.000000%=516;5.000000%=980;10.000000%=1512;20.000000%=2544;30.000000%=3536;40.000000%=4640;50.000000%=5856;60.000000%=7136;70.000000%=8512;80.000000%=10304;90.000000%=12992;95.000000%=15040;99.000000%=20864;99.500000%=24704;99.900000%=31616;99.950000%=36096;99.990000%=49920;0%=0;0%=0;0%=0;117;74133;6706.539900;4699.685374;19184;105920;100.000000%;39208.623746;9873.609517;11759828;39198;9799;300008;2;13989;7.760860;15.613233;18;72731;6343.576015;4718.645055;1.000000%=274;5.000000%=628;10.000000%=1096;20.000000%=2096;30.000000%=3088;40.000000%=4256;50.000000%=5536;60.000000%=6816;70.000000%=8256;80.000000%=10048;90.000000%=12736;95.000000%=14784;99.000000%=20352;99.500000%=23936;99.900000%=30848;99.950000%=35584;99.990000%=49408;0%=0;0%=0;0%=0;46;72737;6351.586102;4718.730575;0;106230;99.857698%;39142.220367;10008.742068;6.318519%;19.728873%;1609555;0;9;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;102.6%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.36%;1.83%;2.39%;2.55%;9.81%;19.10%;42.94%;19.88%;1.12%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%
3;fio-2.1.11;threaded-write;6;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;55408388;184669;46160;300041;2;157251;352.148735;2052.114650;73;499992;44028.011227;25992.718134;1.000000%=15936;5.000000%=20096;10.000000%=22912;20.000000%=26240;30.000000%=29312;40.000000%=32128;50.000000%=35584;60.000000%=39680;70.000000%=46336;80.000000%=59648;90.000000%=77312;95.000000%=93696;99.000000%=136192;99.500000%=160768;99.900000%=234496;99.950000%=272384;99.990000%=354304;0%=0;0%=0;0%=0;86;541592;44373.085359;26212.985734;0;21079;6.256012%;11552.914343;4162.971622;0.468140%;1.568160%;712839;0;133;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;101.1%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.01%;0.01%;0.01%;0.01%;0.14%;4.60%;68.62%;22.87%;3.69%;0.08%;0.00%;0.00%;0.00%;0.00%
3;fio-2.1.11;threaded-read;7;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;40066936;133550;33380;300014;2;99655;481.257743;2499.760742;112;359622;60873.453073;26321.651562;1.000000%=18560;5.000000%=23936;10.000000%=28288;20.000000%=35584;30.000000%=43776;40.000000%=52480;50.000000%=59648;60.000000%=66048;70.000000%=73216;80.000000%=82432;90.000000%=94720;95.000000%=107008;99.000000%=134144;99.500000%=146432;99.900000%=177152;99.950000%=191488;99.990000%=222208;0%=0;0%=0;0%=0;120;359626;61350.867203;26558.494416;0;18039;6.247185%;8343.115235;2477.946533;0.383825%;1.220808%;530506;0;131;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;102.4%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.01%;0.01%;0.02%;0.07%;1.75%;35.27%;55.54%;7.36%;0.01%;0.00%;0.00%;0.00%;0.00%
3;fio-2.1.11;threaded-rw;8;0;12620692;42064;10512;300032;2;110986;763.727238;4019.704110;325;493072;98029.559722;37431.500164;1.000000%=42240;5.000000%=54528;10.000000%=60672;20.000000%=69120;30.000000%=76288;40.000000%=82432;50.000000%=89600;60.000000%=97792;70.000000%=108032;80.000000%=121344;90.000000%=146432;95.000000%=171008;99.000000%=224256;99.500000%=246784;99.900000%=292864;99.950000%=313344;99.990000%=370688;0%=0;0%=0;0%=0;330;512689;98789.855691;37795.994103;0;4624;6.254257%;2630.790594;603.799747;12603308;42006;10498;300032;2;111644;761.412814;4017.881412;45;492974;95357.352877;36438.055557;1.000000%=37632;5.000000%=52480;10.000000%=58624;20.000000%=67072;30.000000%=74240;40.000000%=80384;50.000000%=87552;60.000000%=95744;70.000000%=105984;80.000000%=118272;90.000000%=142336;95.000000%=166912;99.000000%=218112;99.500000%=238592;99.900000%=284672;99.950000%=305152;99.990000%=354304;0%=0;0%=0;0%=0;90;492979;96115.690056;36810.994532;0;4507;6.254383%;2627.216216;602.121743;0.252740%;0.773303%;299655;0;139;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;102.9%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.01%;0.01%;0.01%;0.01%;0.02%;0.02%;0.15%;2.96%;60.23%;36.25%;0.39%;0.00%;0.00%;0.00%;0.00%
3;fio-2.1.11;threaded-80-20;9;0;17507100;58347;14581;300048;2;141219;874.510849;4555.821448;287;565634;111882.252477;41477.577692;1.000000%=49408;5.000000%=66048;10.000000%=72192;20.000000%=80384;30.000000%=88576;40.000000%=95744;50.000000%=103936;60.000000%=112128;70.000000%=122368;80.000000%=136192;90.000000%=160768;95.000000%=187392;99.000000%=264192;99.500000%=296960;99.900000%=374784;99.950000%=403456;99.990000%=452608;0%=0;0%=0;0%=0;305;627529;112756.324332;41888.960593;0;6117;6.251614%;3647.628998;740.301090;4386848;14620;3653;300048;2;136171;878.737148;4562.604358;118;575260;109526.261285;41203.848346;1.000000%=44288;5.000000%=62720;10.000000%=70144;20.000000%=78336;30.000000%=86528;40.000000%=93696;50.000000%=101888;60.000000%=110080;70.000000%=120320;80.000000%=134144;90.000000%=158720;95.000000%=185344;99.000000%=257024;99.500000%=288768;99.900000%=366592;99.950000%=395264;99.990000%=444416;0%=0;0%=0;0%=0;123;607139;110405.318212;41615.417134;198;1545;6.259978%;915.208778;196.089564;0.208066%;0.663111%;259589;0;138;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;103.3%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.01%;0.01%;0.02%;0.01%;0.14%;0.98%;45.00%;52.60%;1.28%;0.01%;0.00%;0.00%;0.00%
3;fio-2.1.11;streaming-write;10;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;87898524;292982;73238;300013;1;21384;3.006695;12.332906;396;243248;27960.236785;21722.606422;1.000000%=4960;5.000000%=10688;10.000000%=13760;20.000000%=15424;30.000000%=16064;40.000000%=16768;50.000000%=17792;60.000000%=19584;70.000000%=22400;80.000000%=48384;90.000000%=63744;95.000000%=71168;99.000000%=98816;99.500000%=111104;99.900000%=140288;99.950000%=152576;99.990000%=195584;0%=0;0%=0;0%=0;461;243251;27963.368901;21722.703211;0;40636;6.312250%;18493.757717;10150.925820;0.776567%;1.603550%;245838;0;144;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;101.6%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.08%;0.38%;3.96%;58.17%;17.86%;18.59%;0.94%;0.00%;0.00%;0.00%;0.00%;0.00%
3;fio-2.1.11;streaming-read;11;0;123034844;410079;102513;300027;1;20361;2.877804;10.503306;386;108023;19973.098572;7614.511025;1.000000%=4960;5.000000%=9792;10.000000%=12864;20.000000%=15296;30.000000%=16064;40.000000%=16512;50.000000%=17280;60.000000%=18304;70.000000%=22144;80.000000%=27776;90.000000%=30592;95.000000%=33024;99.000000%=41728;99.500000%=45824;99.900000%=56576;99.950000%=61184;99.990000%=70144;0%=0;0%=0;0%=0;389;108025;19976.072885;7614.439686;0;41916;6.257225%;25659.564811;7106.118308;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.986705%;2.319228%;350105;0;2187;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;103.7%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.07%;0.45%;5.01%;60.97%;33.22%;0.29%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%
3;fio-2.1.11;streaming-rw;12;0;65896776;219583;54889;300099;1;109885;78.252765;1414.286927;70;694702;33458.571530;36610.619020;1.000000%=1048;5.000000%=2064;10.000000%=3408;20.000000%=8256;30.000000%=20864;40.000000%=24192;50.000000%=26496;60.000000%=29056;70.000000%=32128;80.000000%=40192;90.000000%=64768;95.000000%=99840;99.000000%=193536;99.500000%=236544;99.900000%=342016;99.950000%=419840;99.990000%=518144;0%=0;0%=0;0%=0;78;695743;33536.011509;36632.095144;0;23992;6.283259%;13796.968292;3292.063370;7325708;24410;6102;300099;1;101053;1079.688704;5234.420850;79;694695;32862.151293;37277.174194;1.000000%=668;5.000000%=1576;10.000000%=2768;20.000000%=6496;30.000000%=20096;40.000000%=23680;50.000000%=26240;60.000000%=28544;70.000000%=31872;80.000000%=39168;90.000000%=64768;95.000000%=100864;99.000000%=195584;99.500000%=238592;99.900000%=346112;99.950000%=419840;99.990000%=536576;0%=0;0%=0;0%=0;83;694699;33941.997726;37509.584960;0;2680;6.285896%;1534.387309;364.613938;0.534952%;1.333380%;522535;0;158;0.1%;0.1%;0.1%;0.1%;0.1%;0.1%;102.9%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.09%;0.33%;0.60%;3.97%;7.08%;9.07%;7.04%;57.05%;9.77%;4.60%;0.40%;0.01%;0.00%;0.00%;0.00%